vanilla-java-backend/app/controllers/drink_ingredients_controller.rb

    def index
        dis = DrinkIngredient.all
---
SELECT "drink_ingredients".* FROM "drink_ingredients"

    def create
        di = DrinkIngredient.create(drink_params)
---
INSERT INTO "drink_ingredients" ("drink_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["drink_id", 71], ["ingredient_id", 65], ["created_at", "2021-01-28 05:55:26.722968"], ["updated_at", "2021-01-28 05:55:26.722968"]]

    def show
        di = DrinkIngredient.where(ingredient_id: params[:id])
---
SELECT "drink_ingredients".* FROM "drink_ingredients" WHERE "drink_ingredients"."ingredient_id" = ?  [["ingredient_id", 64]]

    def destroy
        DrinkIngredient.find(params[:id]).destroy
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 81], ["LIMIT", 1]]
DELETE FROM "drink_ingredients" WHERE "drink_ingredients"."id" = ?  [["id", 42]]
SELECT "drink_ingredients".* FROM "drink_ingredients" WHERE "drink_ingredients"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]