vanilla-java-backend/app/controllers/drinks_controller.rb

    def index
     drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"