vanilla-java-backend/app/controllers/ingredients_controller.rb

    def index
        ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"