vanilla-java-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Molly"], ["created_at", "2021-01-27 08:05:02.598505"], ["updated_at", "2021-01-27 08:05:02.598505"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "NewUser2"], ["LIMIT", 1]]
INSERT INTO "drinks" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["user_id", 57], ["created_at", "2021-01-27 22:21:30.542399"], ["updated_at", "2021-01-27 22:21:30.542399"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Molly3"], ["created_at", "2021-01-28 05:11:46.183454"], ["updated_at", "2021-01-28 05:11:46.183454"]]
---
    def create
        user = User.find_or_create_by(name: params[:name])
        newDrink = Drink.create(name: "", user_id: user.id)